In [2]:
# HOW TO READ DATA SETS WITH PANDAS LIBRARY

In [3]:
import pandas as pd

In [7]:
df = pd.read_csv('school dataset.csv')

df.head()

   S/N              NAME       PHONE  AGE  SCORE        DPT  LEVEL
0    1       OLUCHI ORDU  8140041698   24    205        COM    500
1    2    CLARA NWAKAEZE  8120043789   30    200   IND CHEM    400
2    3         ALEX ORDU  8130089001   27    250  BIZ ADMIN    300
3    4  EBENEZER OSUIGBO  7082378454   32    300        COM    200
4    5       ADAEZE OKAH  7020223457   33    250    BIO MED    300

In [8]:
len(df)

10

In [10]:
df = pd.read_csv('school dataset.csv', index_col = 0)
df.head()

                 NAME       PHONE  AGE  SCORE        DPT  LEVEL
S/N
1         OLUCHI ORDU  8140041698   24    205        COM    500
2      CLARA NWAKAEZE  8120043789   30    200   IND CHEM    400
3           ALEX ORDU  8130089001   27    250  BIZ ADMIN    300
4    EBENEZER OSUIGBO  7082378454   32    300        COM    200
5         ADAEZE OKAH  7020223457   33    250    BIO MED    300

In [11]:
df.columns

Index(['NAME', 'PHONE', 'AGE', 'SCORE', 'DPT', 'LEVEL'], dtype='object')

In [ ]:
#. QUERYING A DATA FRAME


# STUDENT THAT SCORED AT LEAST 300

In [15]:
df['SCORE'] > 300

S/N
1     False
2     False
3     False
4     False
5     False
6      True
7     False
8     False
9      True
10    False
Name: SCORE, dtype: bool

In [16]:
only_score = df[df['SCORE'] > 300]
only_score.head()

             NAME       PHONE  AGE  SCORE      DPT  LEVEL
S/N
6     JANE OKAFOR  9066885543   23    350  MEDCINE    100
9    CYNTHIA DINA  9055642391   28    380  BANKING    100

In [17]:
#  HOW MANY DEPERTMENTS WON AT MOST ONE GOLD VARIABLES

In [18]:
only_score['SCORE'].count()     # to check the number of students who scored above 300

2

In [19]:
df['SCORE'].count()     # to check the number of students with score.

10

In [20]:
# HOW MANY STUDENTS ARE IN LEVEL BELOW 500 AND SCORED BELOW 5OO

In [23]:
df['SCORE'] < 500

S/N
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
Name: SCORE, dtype: bool

In [24]:
df['LEVEL'] < 500

S/N
1     False
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10    False
Name: LEVEL, dtype: bool

In [27]:
students = df[(df['SCORE'] < 500) & (df['LEVEL'] < 500)]
students.head()

                 NAME       PHONE  AGE  SCORE        DPT  LEVEL
S/N
2      CLARA NWAKAEZE  8120043789   30    200   IND CHEM    400
3           ALEX ORDU  8130089001   27    250  BIZ ADMIN    300
4    EBENEZER OSUIGBO  7082378454   32    300        COM    200
5         ADAEZE OKAH  7020223457   33    250    BIO MED    300
6         JANE OKAFOR  9066885543   23    350    MEDCINE    100

In [28]:
# TO GET THE LENTH FOR BOTH SCORE AND LEVEL BELOW 500

In [29]:
len(df[(df['SCORE'] < 500) & (df['LEVEL'] < 500)])

8

In [30]:
# HOW TO FIND MISSING VALUES IN A DATA SET
# 1. LOOK FOR THE MAIN DATA SET SOURCE ONLINE
# 2. DROPPING THE MISSING DATA VALUES BY ROWS OR COLUMS
# 3. FILLING THE MISSING VALUES WITH THE MEAN, MEDIAN OR MODE

In [35]:
names = df.where(df['SCORE'] < 300)   # THIS MEANS ANYWHERE SCORE IS LESS THEN 300 REPLACE WITH A MISING VALUE
names.head()

               NAME         PHONE   AGE  SCORE        DPT  LEVEL
S/N
1       OLUCHI ORDU  8.140042e+09  24.0  205.0        COM  500.0
2    CLARA NWAKAEZE  8.120044e+09  30.0  200.0   IND CHEM  400.0
3         ALEX ORDU  8.130089e+09  27.0  250.0  BIZ ADMIN  300.0
4               NaN           NaN   NaN    NaN        NaN    NaN
5       ADAEZE OKAH  7.020223e+09  33.0  250.0    BIO MED  300.0

In [36]:
# TO CHECK IF DATA SET CONTAINS A MISSING VALUE

names.isnull().values.any()

True

In [37]:
students.isnull().values.any()

False

In [38]:
names.isnull().sum() # to know the number of each missing value

NAME     3
PHONE    3
AGE      3
SCORE    3
DPT      3
LEVEL    3
dtype: int64

In [39]:
# DROPPING A ROW OF A MISSING DATA  (when dropping a dataset we use .DROPNA)

In [40]:
names.dropna(axis = 0)  #drop by row

               NAME         PHONE   AGE  SCORE          DPT  LEVEL
S/N
1       OLUCHI ORDU  8.140042e+09  24.0  205.0          COM  500.0
2    CLARA NWAKAEZE  8.120044e+09  30.0  200.0     IND CHEM  400.0
3         ALEX ORDU  8.130089e+09  27.0  250.0    BIZ ADMIN  300.0
5       ADAEZE OKAH  7.020223e+09  33.0  250.0      BIO MED  300.0
7           INI EDO  7.086554e+09  20.0  190.0          LAW  200.0
8    SOPHIA OSUIGBO  8.140020e+09  23.0  220.0  ELECT ELECT  400.0
10      DIANA AKANO  7.045379e+09  22.0  200.0  HOSPITALITY  500.0

In [41]:
len(names.dropna(axis = 0))   # to know the number of rows dropped

7

In [42]:
names.dropna(axis = 1)  # droping by colums

Empty DataFrame
Columns: []
Index: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [47]:
 # FILLING MISSING VALUES    (WHEN FILLING IN A DATA SET WE USE .FILLNA)

In [45]:
df.mean()    #filling by mean

/var/folders/ng/s1jd2v69169bcj5666zvl2880000gn/T/ipykernel_2630/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

PHONE    7.888726e+09
AGE      2.620000e+01
SCORE    2.545000e+02
LEVEL    3.000000e+02
dtype: float64

In [51]:
# names_fillna_mean= names.fillna(df.mean())

In [49]:
names.head()

               NAME         PHONE   AGE  SCORE        DPT  LEVEL
S/N
1       OLUCHI ORDU  8.140042e+09  24.0  205.0        COM  500.0
2    CLARA NWAKAEZE  8.120044e+09  30.0  200.0   IND CHEM  400.0
3         ALEX ORDU  8.130089e+09  27.0  250.0  BIZ ADMIN  300.0
4               NaN           NaN   NaN    NaN        NaN    NaN
5       ADAEZE OKAH  7.020223e+09  33.0  250.0    BIO MED  300.0

In [52]:
names_fillna_mean.head()

               NAME         PHONE   AGE  SCORE        DPT  LEVEL
S/N
1       OLUCHI ORDU  8.140042e+09  24.0  205.0        COM  500.0
2    CLARA NWAKAEZE  8.120044e+09  30.0  200.0   IND CHEM  400.0
3         ALEX ORDU  8.130089e+09  27.0  250.0  BIZ ADMIN  300.0
4               NaN  7.888726e+09  26.2  254.5        NaN  300.0
5       ADAEZE OKAH  7.020223e+09  33.0  250.0    BIO MED  300.0

In [59]:
# df.median()   (filling by median)

In [60]:
# names_fillna_median= names.fillna(df.median())

In [57]:
names_fillna_mode= names.fillna(df.mode())   # filling by mode

names.head()

               NAME         PHONE   AGE  SCORE        DPT  LEVEL
S/N
1       OLUCHI ORDU  8.140042e+09  24.0  205.0        COM  500.0
2    CLARA NWAKAEZE  8.120044e+09  30.0  200.0   IND CHEM  400.0
3         ALEX ORDU  8.130089e+09  27.0  250.0  BIZ ADMIN  300.0
4               NaN           NaN   NaN    NaN        NaN    NaN
5       ADAEZE OKAH  7.020223e+09  33.0  250.0    BIO MED  300.0